{"question": "Does the inevitable discovery doctrine create a per se exception to the exclusionary rule for evidence seized after a Fourth Amendment \"knock and announce\" violation or is evidence subject to suppression after such violations?", "question_category": "SCALR", "source": "Westlaw", "case_id": "scalr-1"}
{"question": "Is it the case that a claimed invention cannot be held \"obvious\", and thus unpatentable under 35 U.S.C. § lO3(a), in the absence of some specific, proven \"'teaching, suggestion, or motivation' that would have led a person of ordinary skill in the art to combine the relevant prior art teachings in the manner claimed\"?", "question_category": "SCALR", "source": "Westlaw", "case_id": "scalr-2"}
{"question": "Did Congress divest the federal district courts of their federal-question jurisdiction under 28 U.S.C. § 1331 over private actions brought under the Telephone Consumer Protection Act?", "question_category": "SCALR", "source": "Westlaw", "case_id": "scalr-5"}
{"question": "Prosecutors in the Orleans Parish District Attorney's Office hid exculpatory evidence, violating John Thompson's rights under Brady v. Maryland, 373 U.S. 83 (1963). Despite no history of similar violations, the office was found liable under § 1983 for failing to train prosecutors. Inadequate training may give rise to municipal liability if it shows \"deliberate indifference\" and actually causes a violation. See City of Canton v. Harris, 489 U.S. 658, 389-91 (1978); Bd. of County Comm'rs of Bryan County v. Brown, 520 U.S. 397, 403-07 (1997). A pattern of violations is usually necessary to show culpability and causation, but in rare cases one violation may suffice. Bryan County, 520 U.S., at 409. The Court has hypothesized only one example justifying single-incident liability: a failure to train police officers on using deadly force. See Canton, 489 U.S., at 390 n.10. Does imposing failure-to-train liability on a district attorney's office for a single Brady violation contravene the rigorous culpability and causation standards of Canton and Bryan County?", "question_category": "SCALR", "source": "Westlaw", "case_id": "scalr-7"}
{"question": "Should the Federal Communications Commission’s determination that the broadcast of vulgar expletives may violate federal restrictions on the broadcast of “any obscene, indecent, or profane language,” 18 U.S.C. 1464; see 47 C.F.R. 73.3999, when the expletives are not repeated, be stricken down?", "question_category": "SCALR", "source": "Westlaw", "case_id": "scalr-11"}
{"question": "Does the Equal Protection Clause precludee a local taxing authority from refusing to refund payments made by those who have paid their assessments in full, even though they forgave the obligations of identically situated taxpayers who chose to pay over a multi-year installment plan?", "question_category": "SCALR", "source": "Westlaw", "case_id": "scalr-13"}
{"question": "Is a habeas petitioner's claim considered \"adjudicated on the merits\" for purposes of 28 U.S.C. § 2254(d) where the state court denied relief in an explained decision but did not expressly acknowledge a federal-law basis for the claim?", "question_category": "SCALR", "source": "Westlaw", "case_id": "scalr-14"}
{"question": "The deadlines for objecting to a debtor's discharge in bankruptcy are set by Bankruptcy Rule 4004. Are the deadlines established by the bankruptcy rules for objecting to discharge jurisdictional?", "question_category": "SCALR", "source": "Westlaw", "case_id": "scalr-15"}
{"question": "Bankruptcy Rules permit discharge of a student loan only through an adversary proceeding, commenced by filing a complaint and serving it and a summons on an appropriate agent of the creditor. Instead, debtor merely included a declaration of discharge in his Chapter 13 plan and mailed it to creditor's post office box. Does such procedure meet the rigorous demands of due process and entitle the resulting orders to respect under principles of res judicata?", "question_category": "SCALR", "source": "Westlaw", "case_id": "scalr-16"}
{"question": "Must a district court admit \"me, too\" evidence -- i.e., testimony, by nonparties, alleging discrimination at the hands of persons who played no role in the adverse employment decision challenged by the plaintiff?", "question_category": "SCALR", "source": "Westlaw", "case_id": "scalr-17"}
{"question": "In Phillips v. Washington Legal Found. , 524 U .S. 156 (1998), the Supreme Court held that the interest on clients' funds held in so-called IOLTA accounts (\"Interest on Lawyers' Trust Accounts\") was the property of the clients. Does a regulatory scheme for funding state legal services by systematically seizing this property violate the Takings Clause of the Fifth Amendment to the Constitution such that the property owners are entitled to relief?", "question_category": "SCALR", "source": "Westlaw", "case_id": "scalr-18"}
{"question": "Do 28 U.S.C §§1346(b) and 2680(h) waive the sovereign immunity of the United States for the intentional torts of prison guards when they are acting within the scope of their employment but are not exercising their authority to execute searches, to seize evidence, or to make arrests for violations of federal law?", "question_category": "SCALR", "source": "Westlaw", "case_id": "scalr-20"}
{"question": "A department of corrections revised its prison visitation policy to: (1) prohibit visits by a minor child, unless the minor is the child, stepchild or grandchild of the prisoner; (2) prohibit visits by a prisoner's child when the prisoner's parental rights have been terminated; (3) require that all visiting minor children be accompanied by a parent or legal guardian; (4) prohibit visits by former inmates unless the former inmate is in the prisoner's immediate family; and (5) impose a ban on visitation for a minimum of two years for any inmate found guilty of two or more major misconducts for substance abuse. Do the policies violate the prisoners’ First and Fourteenth Amendment rights?", "question_category": "SCALR", "source": "Westlaw", "case_id": "scalr-21"}
{"question": "Does a defendant-who has fraudulently obtained a loan and thus owes restitution for the loan under 18 U.S.C. § 3663A(b)(1)(B)-return \"any part\" of the loan money by giving the lenders the collateral that secures the money?", "question_category": "SCALR", "source": "Westlaw", "case_id": "scalr-27"}
{"question": "Does a case become moot, and thus beyond the judicial power of Article III, when the lone plaintiff receives an offer from the defendants to satisfy all of the plaintiff's claims?", "question_category": "SCALR", "source": "Westlaw", "case_id": "scalr-30"}
{"question": "What are the four fair use factors?", "question_category": "Rule QA", "source": "Westlaw", "case_id": "rule-qa-32"}
{"question": "Per the Hertz \"nerve center\" test, where is a corporation's principal place of business?", "question_category": "Rule QA", "source": "Westlaw", "case_id": "rule-qa-33"}
{"question": "What are the 5 categories for distinctiveness under the Abercrombie spectrum for trademarks?", "question_category": "Rule QA", "source": "Westlaw", "case_id": "rule-qa-34"}
{"question": "Under the Abercrombie distinctiveness spectrum, what are suggestive terms?", "question_category": "Rule QA", "source": "Westlaw", "case_id": "rule-qa-35"}
{"question": "Under the Abercrombie distinctiveness spectrum, what are fanciful terms?", "question_category": "Rule QA", "source": "Westlaw", "case_id": "rule-qa-39"}
{"question": "What are the two types of fair use defenses for trademarks?", "question_category": "Rule QA", "source": "Westlaw", "case_id": "rule-qa-41"}
{"question": "What are the 6 enumerated factors for a trademark blurring claim?", "question_category": "Rule QA", "source": "Westlaw", "case_id": "rule-qa-44"}
{"question": "What are the requirements for a dying declaration?", "question_category": "Rule QA", "source": "Westlaw", "case_id": "rule-qa-48"}
{"question": "What is a co-conspirator admission under the Federal Rules of Evidence?", "question_category": "Rule QA", "source": "Westlaw", "case_id": "rule-qa-49"}
{"question": "For which types of cases is a dying declaration admissible in federal court?", "question_category": "Rule QA", "source": "Westlaw", "case_id": "rule-qa-50"}
{"question": "In the Fifth Circuit, can a person subject to domestic-violence-related restraining orders be prohibited from purchasing a firearm?", "question_category": "Changes in Law", "source": "Westlaw", "case_id": "changes-in-law-71"}
{"question": "When does the undue burden standard apply in abortion cases?", "question_category": "Changes in Law", "source": "Westlaw", "case_id": "changes-in-law-73"}
{"question": "In California, can a nurse practitioner ever perform an abortion without a physician present?", "question_category": "Changes in Law", "source": "Westlaw", "case_id": "changes-in-law-74"}
{"question": "Is it a crime to camp on state-owned lands in Missouri without authorization?", "question_category": "Changes in Law", "source": "Westlaw", "case_id": "changes-in-law-75"}
{"question": "Do law enforcement officers in California have to inform drivers why they are being pulled over?", "question_category": "Changes in Law", "source": "Westlaw", "case_id": "changes-in-law-77"}
{"question": "A city passed an ordinance prohibiting doorto-door solicitation of contributions by charitable organizations that did not use at least 75% of their receipts for \"charitable purposes.\" The ordinance further provided that anyone wishing to solicit for purposes of charity must obtain a permit and present satisfactory proof that at least 75% of the proceeds of such solicitation will be used directly for the charitable purposes of the organization. An organization seeking to solicit support within the city applied for and was denied a permit because it did not meet the 75% requirement. As applied to the organization, is the ordinance constitutional?", "question_category": "Bar Exam", "source": "Westlaw", "case_id": "bar-exam-82"}
{"question": "A mechanic was tried for the aggravated assault of a nurse. The mechanic called a witness to the witness stand. The witness was to testify that the night before the alleged crime, the mechanic stated to the witness that he was going to visit his mother in a distant city some 1,000 miles away. Is the testimony admissible?", "question_category": "Bar Exam", "source": "Westlaw", "case_id": "bar-exam-83"}
{"question": "A patient troubled by an irritating skin rash consulted a dermatologist for treatment. The dermatologist diagnosed the rash as a genetic condition that had no cure and would ultimately spread and lead to disfigurement. The patient was shocked and upset by the diagnosis. On the advice of her family, a week later the patient consulted another doctor. That doctor immediately diagnosed the skin rash as a common bacterial infection and prescribed an ointment that cleared up the condition in a few days. Because the doctor was a friend of the family, the patient was not charged for that visit. Can the patient recover from the dermatologist for the emotional distress caused by his erroneous diagnosis?", "question_category": "Bar Exam", "source": "Westlaw", "case_id": "bar-exam-86"}
{"question": "A patient went to a highly reputable dentist, who honestly told her that she needed a lot of dental work, some of it involving complex procedures. When she asked the dentist what the cost would be, he told her \"about $3,500.\" The patient agreed to use him as her dentist and he began her treatment. When the patient's treatment was finished, the dentist sent her a bill for $4,100, explaining that the higher bill was because more expensive inlays were used, and that he carefully documented the cost of his materials and had sound medical reasons for his decision. The patient honestly believed that it was unfair for the dentist to charge her $4,100. Therefore, she sent the dentist's invoice back to him, along with a check for $3,500. On the check the patient had clearly written \"Payment In Full.\" The dentist read the notation on the check and deposited it at his bank. The dentist made no notation of his own on the check other than his signature on the back as an indorsement. Two weeks later the dentist called his bank to make sure that the patient's check had cleared. He then immediately filed suit against the patient for $600. Will the court award the dentist $600?", "question_category": "Bar Exam", "source": "Westlaw", "case_id": "bar-exam-88"}
{"question": "A young man proposed to his girlfriend, but she was reluctant because of his meager income and lack of job potential. The young man told his father about her reluctance. The father told the girlfriend that if she married his son, he would support them for six months and send his son to a six-month computer technology training school. This was sufficient to dispel her reservations and the two were married very soon after. When they returned from their honeymoon, the father refused to go through with his offer. Although the girlfriend is happy in her marriage, she sued the father for damages. If the father prevails, it will be because:", "question_category": "Bar Exam", "source": "Westlaw", "case_id": "bar-exam-89"}
{"question": "A plaintiff applied for a life insurance policy and was required to submit to a physical examination to qualify for the policy. During the course of the examination, the plaintiff told the physician, who was approved by the life insurance company and had never seen the plaintiff before, \"I used to have some back trouble, but that's all cleared up now.\" A few weeks after the examination, the defendant's automobile struck the rear end of a car in which the plaintiff was riding as a passenger. The plaintiff now claims that he suffers persistent lower back pain and sues the defendant for damages. After laying a proper foundation that the plaintiff is attempting to perpetrate a fraud, the defendant calls the physician as a witness and seeks to have her testify as to the plaintiff's statement to her. The plaintiff's attorney objects on the ground of the jurisdiction's physician-patient privilege. Is the testimony as to the plaintiff's statement admissible?", "question_category": "Bar Exam", "source": "Westlaw", "case_id": "bar-exam-90"}
{"question": "The owner of a large parcel of land subdivided it into 20 separate lots. He sold lots 1-19, retaining lot 20 for himself to live on. The deeds for each of the 19 lots sold by the owner contained the following restriction: \"All lots within the subdivision shall be used for residential purposes only.\" The purchasers of lots 1-19 each built residences on their property. The owner lived on lot 20 until his death, when it was sold without any restrictions to a buyer. Subsequently, the buyer sold lot 20 to a grocer, furnishing him with an abstract of title and assuring him that the land was unrestricted. The abstract of title showed that lot 20 was not restricted. The following year, the grocer decided to build a grocery store on lot 20. A homeowner who owned adjoining property in the subdivision informed the grocer of the restriction and told him that he would be unable to build the grocery store. If the homeowner brings suit seeking an injunction against the grocer's building of the grocery store, will she prevail?", "question_category": "Bar Exam", "source": "Westlaw", "case_id": "bar-exam-93"}
{"question": "A friend knew that a man and a woman cared deeply for each other and encouraged the man to ask the woman to marry. Unbeknownst to the friend, the man was already married. Finally, after continued encouragement by the friend, the man went through a marriage ceremony with the woman, and the friend was the man's best man at the ceremony. If the friend is charged with being an accessory to bigamy, should he be found guilty or not guilty?", "question_category": "Bar Exam", "source": "Westlaw", "case_id": "bar-exam-95"}
{"question": "Traveler was a passenger on a commercial aircraft owned and operated by Airline. The aircraft crashed into a mountain, killing everyone on board. The flying weather was good. Traveler's legal representative brought a wrongful death action against Airline. At trial, the legal representative offered no expert or other testimony as to the cause of the crash. On Airline's motion to dismiss at the conclusion of the legal representative's case, should the court grant or deny the motion?", "question_category": "Bar Exam", "source": "Westlaw", "case_id": "bar-exam-96"}
{"question": "In a criminal trial, the prosecutor called a witness to the stand to authenticate the voice in a tape recording as the defendant's. The only other time the witness had heard the defendant's voice was after his arrest. Assuming a proper foundation has been laid, may the witness properly authenticate the defendant's voice?", "question_category": "Bar Exam", "source": "Westlaw", "case_id": "bar-exam-98"}
{"question": "Does the inevitable discovery doctrine create a per se exception to the exclusionary rule for evidence seized after a Fourth Amendment \"knock and announce\" violation or is evidence subject to suppression after such violations?", "question_category": "SCALR", "source": "Pract. Law", "case_id": "scalr-1"}
{"question": "Is it the case that a claimed invention cannot be held \"obvious\", and thus unpatentable under 35 U.S.C. § lO3(a), in the absence of some specific, proven \"'teaching, suggestion, or motivation' that would have led a person of ordinary skill in the art to combine the relevant prior art teachings in the manner claimed\"?", "question_category": "SCALR", "source": "Pract. Law", "case_id": "scalr-2"}
{"question": "Did Congress divest the federal district courts of their federal-question jurisdiction under 28 U.S.C. § 1331 over private actions brought under the Telephone Consumer Protection Act?", "question_category": "SCALR", "source": "Pract. Law", "case_id": "scalr-5"}
{"question": "Prosecutors in the Orleans Parish District Attorney's Office hid exculpatory evidence, violating John Thompson's rights under Brady v. Maryland, 373 U.S. 83 (1963). Despite no history of similar violations, the office was found liable under § 1983 for failing to train prosecutors. Inadequate training may give rise to municipal liability if it shows \"deliberate indifference\" and actually causes a violation. See City of Canton v. Harris, 489 U.S. 658, 389-91 (1978); Bd. of County Comm'rs of Bryan County v. Brown, 520 U.S. 397, 403-07 (1997). A pattern of violations is usually necessary to show culpability and causation, but in rare cases one violation may suffice. Bryan County, 520 U.S., at 409. The Court has hypothesized only one example justifying single-incident liability: a failure to train police officers on using deadly force. See Canton, 489 U.S., at 390 n.10. Does imposing failure-to-train liability on a district attorney's office for a single Brady violation contravene the rigorous culpability and causation standards of Canton and Bryan County?", "question_category": "SCALR", "source": "Pract. Law", "case_id": "scalr-7"}
{"question": "Should the Federal Communications Commission’s determination that the broadcast of vulgar expletives may violate federal restrictions on the broadcast of “any obscene, indecent, or profane language,” 18 U.S.C. 1464; see 47 C.F.R. 73.3999, when the expletives are not repeated, be stricken down?", "question_category": "SCALR", "source": "Pract. Law", "case_id": "scalr-11"}
{"question": "Does the Equal Protection Clause precludee a local taxing authority from refusing to refund payments made by those who have paid their assessments in full, even though they forgave the obligations of identically situated taxpayers who chose to pay over a multi-year installment plan?", "question_category": "SCALR", "source": "Pract. Law", "case_id": "scalr-13"}
{"question": "Is a habeas petitioner's claim considered \"adjudicated on the merits\" for purposes of 28 U.S.C. § 2254(d) where the state court denied relief in an explained decision but did not expressly acknowledge a federal-law basis for the claim?", "question_category": "SCALR", "source": "Pract. Law", "case_id": "scalr-14"}
{"question": "The deadlines for objecting to a debtor's discharge in bankruptcy are set by Bankruptcy Rule 4004. Are the deadlines established by the bankruptcy rules for objecting to discharge jurisdictional?", "question_category": "SCALR", "source": "Pract. Law", "case_id": "scalr-15"}
{"question": "Bankruptcy Rules permit discharge of a student loan only through an adversary proceeding, commenced by filing a complaint and serving it and a summons on an appropriate agent of the creditor. Instead, debtor merely included a declaration of discharge in his Chapter 13 plan and mailed it to creditor's post office box. Does such procedure meet the rigorous demands of due process and entitle the resulting orders to respect under principles of res judicata?", "question_category": "SCALR", "source": "Pract. Law", "case_id": "scalr-16"}
{"question": "Must a district court admit \"me, too\" evidence -- i.e., testimony, by nonparties, alleging discrimination at the hands of persons who played no role in the adverse employment decision challenged by the plaintiff?", "question_category": "SCALR", "source": "Pract. Law", "case_id": "scalr-17"}
{"question": "In Phillips v. Washington Legal Found. , 524 U .S. 156 (1998), the Supreme Court held that the interest on clients' funds held in so-called IOLTA accounts (\"Interest on Lawyers' Trust Accounts\") was the property of the clients. Does a regulatory scheme for funding state legal services by systematically seizing this property violate the Takings Clause of the Fifth Amendment to the Constitution such that the property owners are entitled to relief?", "question_category": "SCALR", "source": "Pract. Law", "case_id": "scalr-18"}
{"question": "Do 28 U.S.C §§1346(b) and 2680(h) waive the sovereign immunity of the United States for the intentional torts of prison guards when they are acting within the scope of their employment but are not exercising their authority to execute searches, to seize evidence, or to make arrests for violations of federal law?", "question_category": "SCALR", "source": "Pract. Law", "case_id": "scalr-20"}
{"question": "A department of corrections revised its prison visitation policy to: (1) prohibit visits by a minor child, unless the minor is the child, stepchild or grandchild of the prisoner; (2) prohibit visits by a prisoner's child when the prisoner's parental rights have been terminated; (3) require that all visiting minor children be accompanied by a parent or legal guardian; (4) prohibit visits by former inmates unless the former inmate is in the prisoner's immediate family; and (5) impose a ban on visitation for a minimum of two years for any inmate found guilty of two or more major misconducts for substance abuse. Do the policies violate the prisoners’ First and Fourteenth Amendment rights?", "question_category": "SCALR", "source": "Pract. Law", "case_id": "scalr-21"}
{"question": "Does a defendant-who has fraudulently obtained a loan and thus owes restitution for the loan under 18 U.S.C. § 3663A(b)(1)(B)-return \"any part\" of the loan money by giving the lenders the collateral that secures the money?", "question_category": "SCALR", "source": "Pract. Law", "case_id": "scalr-27"}
{"question": "Does a case become moot, and thus beyond the judicial power of Article III, when the lone plaintiff receives an offer from the defendants to satisfy all of the plaintiff's claims?", "question_category": "SCALR", "source": "Pract. Law", "case_id": "scalr-30"}
{"question": "What are the four fair use factors?", "question_category": "Rule QA", "source": "Pract. Law", "case_id": "rule-qa-32"}
{"question": "Per the Hertz \"nerve center\" test, where is a corporation's principal place of business?", "question_category": "Rule QA", "source": "Pract. Law", "case_id": "rule-qa-33"}
{"question": "What are the 5 categories for distinctiveness under the Abercrombie spectrum for trademarks?", "question_category": "Rule QA", "source": "Pract. Law", "case_id": "rule-qa-34"}
{"question": "Under the Abercrombie distinctiveness spectrum, what are suggestive terms?", "question_category": "Rule QA", "source": "Pract. Law", "case_id": "rule-qa-35"}
{"question": "Under the Abercrombie distinctiveness spectrum, what are fanciful terms?", "question_category": "Rule QA", "source": "Pract. Law", "case_id": "rule-qa-39"}
{"question": "What are the two types of fair use defenses for trademarks?", "question_category": "Rule QA", "source": "Pract. Law", "case_id": "rule-qa-41"}
{"question": "What are the 6 enumerated factors for a trademark blurring claim?", "question_category": "Rule QA", "source": "Pract. Law", "case_id": "rule-qa-44"}
{"question": "What are the requirements for a dying declaration?", "question_category": "Rule QA", "source": "Pract. Law", "case_id": "rule-qa-48"}
{"question": "What is a co-conspirator admission under the Federal Rules of Evidence?", "question_category": "Rule QA", "source": "Pract. Law", "case_id": "rule-qa-49"}
{"question": "For which types of cases is a dying declaration admissible in federal court?", "question_category": "Rule QA", "source": "Pract. Law", "case_id": "rule-qa-50"}
{"question": "In the Fifth Circuit, can a person subject to domestic-violence-related restraining orders be prohibited from purchasing a firearm?", "question_category": "Changes in Law", "source": "Pract. Law", "case_id": "changes-in-law-71"}
{"question": "When does the undue burden standard apply in abortion cases?", "question_category": "Changes in Law", "source": "Pract. Law", "case_id": "changes-in-law-73"}
{"question": "In California, can a nurse practitioner ever perform an abortion without a physician present?", "question_category": "Changes in Law", "source": "Pract. Law", "case_id": "changes-in-law-74"}
{"question": "Is it a crime to camp on state-owned lands in Missouri without authorization?", "question_category": "Changes in Law", "source": "Pract. Law", "case_id": "changes-in-law-75"}
{"question": "Do law enforcement officers in California have to inform drivers why they are being pulled over?", "question_category": "Changes in Law", "source": "Pract. Law", "case_id": "changes-in-law-77"}
{"question": "A city passed an ordinance prohibiting doorto-door solicitation of contributions by charitable organizations that did not use at least 75% of their receipts for \"charitable purposes.\" The ordinance further provided that anyone wishing to solicit for purposes of charity must obtain a permit and present satisfactory proof that at least 75% of the proceeds of such solicitation will be used directly for the charitable purposes of the organization. An organization seeking to solicit support within the city applied for and was denied a permit because it did not meet the 75% requirement. As applied to the organization, is the ordinance constitutional?", "question_category": "Bar Exam", "source": "Pract. Law", "case_id": "bar-exam-82"}
{"question": "A mechanic was tried for the aggravated assault of a nurse. The mechanic called a witness to the witness stand. The witness was to testify that the night before the alleged crime, the mechanic stated to the witness that he was going to visit his mother in a distant city some 1,000 miles away. Is the testimony admissible?", "question_category": "Bar Exam", "source": "Pract. Law", "case_id": "bar-exam-83"}
{"question": "A patient troubled by an irritating skin rash consulted a dermatologist for treatment. The dermatologist diagnosed the rash as a genetic condition that had no cure and would ultimately spread and lead to disfigurement. The patient was shocked and upset by the diagnosis. On the advice of her family, a week later the patient consulted another doctor. That doctor immediately diagnosed the skin rash as a common bacterial infection and prescribed an ointment that cleared up the condition in a few days. Because the doctor was a friend of the family, the patient was not charged for that visit. Can the patient recover from the dermatologist for the emotional distress caused by his erroneous diagnosis?", "question_category": "Bar Exam", "source": "Pract. Law", "case_id": "bar-exam-86"}
{"question": "A patient went to a highly reputable dentist, who honestly told her that she needed a lot of dental work, some of it involving complex procedures. When she asked the dentist what the cost would be, he told her \"about $3,500.\" The patient agreed to use him as her dentist and he began her treatment. When the patient's treatment was finished, the dentist sent her a bill for $4,100, explaining that the higher bill was because more expensive inlays were used, and that he carefully documented the cost of his materials and had sound medical reasons for his decision. The patient honestly believed that it was unfair for the dentist to charge her $4,100. Therefore, she sent the dentist's invoice back to him, along with a check for $3,500. On the check the patient had clearly written \"Payment In Full.\" The dentist read the notation on the check and deposited it at his bank. The dentist made no notation of his own on the check other than his signature on the back as an indorsement. Two weeks later the dentist called his bank to make sure that the patient's check had cleared. He then immediately filed suit against the patient for $600. Will the court award the dentist $600?", "question_category": "Bar Exam", "source": "Pract. Law", "case_id": "bar-exam-88"}
{"question": "A young man proposed to his girlfriend, but she was reluctant because of his meager income and lack of job potential. The young man told his father about her reluctance. The father told the girlfriend that if she married his son, he would support them for six months and send his son to a six-month computer technology training school. This was sufficient to dispel her reservations and the two were married very soon after. When they returned from their honeymoon, the father refused to go through with his offer. Although the girlfriend is happy in her marriage, she sued the father for damages. If the father prevails, it will be because:", "question_category": "Bar Exam", "source": "Pract. Law", "case_id": "bar-exam-89"}
{"question": "A plaintiff applied for a life insurance policy and was required to submit to a physical examination to qualify for the policy. During the course of the examination, the plaintiff told the physician, who was approved by the life insurance company and had never seen the plaintiff before, \"I used to have some back trouble, but that's all cleared up now.\" A few weeks after the examination, the defendant's automobile struck the rear end of a car in which the plaintiff was riding as a passenger. The plaintiff now claims that he suffers persistent lower back pain and sues the defendant for damages. After laying a proper foundation that the plaintiff is attempting to perpetrate a fraud, the defendant calls the physician as a witness and seeks to have her testify as to the plaintiff's statement to her. The plaintiff's attorney objects on the ground of the jurisdiction's physician-patient privilege. Is the testimony as to the plaintiff's statement admissible?", "question_category": "Bar Exam", "source": "Pract. Law", "case_id": "bar-exam-90"}
{"question": "The owner of a large parcel of land subdivided it into 20 separate lots. He sold lots 1-19, retaining lot 20 for himself to live on. The deeds for each of the 19 lots sold by the owner contained the following restriction: \"All lots within the subdivision shall be used for residential purposes only.\" The purchasers of lots 1-19 each built residences on their property. The owner lived on lot 20 until his death, when it was sold without any restrictions to a buyer. Subsequently, the buyer sold lot 20 to a grocer, furnishing him with an abstract of title and assuring him that the land was unrestricted. The abstract of title showed that lot 20 was not restricted. The following year, the grocer decided to build a grocery store on lot 20. A homeowner who owned adjoining property in the subdivision informed the grocer of the restriction and told him that he would be unable to build the grocery store. If the homeowner brings suit seeking an injunction against the grocer's building of the grocery store, will she prevail?", "question_category": "Bar Exam", "source": "Pract. Law", "case_id": "bar-exam-93"}
{"question": "A friend knew that a man and a woman cared deeply for each other and encouraged the man to ask the woman to marry. Unbeknownst to the friend, the man was already married. Finally, after continued encouragement by the friend, the man went through a marriage ceremony with the woman, and the friend was the man's best man at the ceremony. If the friend is charged with being an accessory to bigamy, should he be found guilty or not guilty?", "question_category": "Bar Exam", "source": "Pract. Law", "case_id": "bar-exam-95"}
{"question": "Traveler was a passenger on a commercial aircraft owned and operated by Airline. The aircraft crashed into a mountain, killing everyone on board. The flying weather was good. Traveler's legal representative brought a wrongful death action against Airline. At trial, the legal representative offered no expert or other testimony as to the cause of the crash. On Airline's motion to dismiss at the conclusion of the legal representative's case, should the court grant or deny the motion?", "question_category": "Bar Exam", "source": "Pract. Law", "case_id": "bar-exam-96"}
{"question": "In a criminal trial, the prosecutor called a witness to the stand to authenticate the voice in a tape recording as the defendant's. The only other time the witness had heard the defendant's voice was after his arrest. Assuming a proper foundation has been laid, may the witness properly authenticate the defendant's voice?", "question_category": "Bar Exam", "source": "Pract. Law", "case_id": "bar-exam-98"}
{"question": "Does the inevitable discovery doctrine create a per se exception to the exclusionary rule for evidence seized after a Fourth Amendment \"knock and announce\" violation or is evidence subject to suppression after such violations?", "question_category": "SCALR", "source": "Lexis", "case_id": "scalr-1"}
{"question": "Is it the case that a claimed invention cannot be held \"obvious\", and thus unpatentable under 35 U.S.C. § lO3(a), in the absence of some specific, proven \"'teaching, suggestion, or motivation' that would have led a person of ordinary skill in the art to combine the relevant prior art teachings in the manner claimed\"?", "question_category": "SCALR", "source": "Lexis", "case_id": "scalr-2"}
{"question": "Did Congress divest the federal district courts of their federal-question jurisdiction under 28 U.S.C. § 1331 over private actions brought under the Telephone Consumer Protection Act?", "question_category": "SCALR", "source": "Lexis", "case_id": "scalr-5"}
{"question": "Prosecutors in the Orleans Parish District Attorney's Office hid exculpatory evidence, violating John Thompson's rights under Brady v. Maryland, 373 U.S. 83 (1963). Despite no history of similar violations, the office was found liable under § 1983 for failing to train prosecutors. Inadequate training may give rise to municipal liability if it shows \"deliberate indifference\" and actually causes a violation. See City of Canton v. Harris, 489 U.S. 658, 389-91 (1978); Bd. of County Comm'rs of Bryan County v. Brown, 520 U.S. 397, 403-07 (1997). A pattern of violations is usually necessary to show culpability and causation, but in rare cases one violation may suffice. Bryan County, 520 U.S., at 409. The Court has hypothesized only one example justifying single-incident liability: a failure to train police officers on using deadly force. See Canton, 489 U.S., at 390 n.10. Does imposing failure-to-train liability on a district attorney's office for a single Brady violation contravene the rigorous culpability and causation standards of Canton and Bryan County?", "question_category": "SCALR", "source": "Lexis", "case_id": "scalr-7"}
{"question": "Should the Federal Communications Commission’s determination that the broadcast of vulgar expletives may violate federal restrictions on the broadcast of “any obscene, indecent, or profane language,” 18 U.S.C. 1464; see 47 C.F.R. 73.3999, when the expletives are not repeated, be stricken down?", "question_category": "SCALR", "source": "Lexis", "case_id": "scalr-11"}
{"question": "Does the Equal Protection Clause precludee a local taxing authority from refusing to refund payments made by those who have paid their assessments in full, even though they forgave the obligations of identically situated taxpayers who chose to pay over a multi-year installment plan?", "question_category": "SCALR", "source": "Lexis", "case_id": "scalr-13"}
{"question": "Is a habeas petitioner's claim considered \"adjudicated on the merits\" for purposes of 28 U.S.C. § 2254(d) where the state court denied relief in an explained decision but did not expressly acknowledge a federal-law basis for the claim?", "question_category": "SCALR", "source": "Lexis", "case_id": "scalr-14"}
{"question": "The deadlines for objecting to a debtor's discharge in bankruptcy are set by Bankruptcy Rule 4004. Are the deadlines established by the bankruptcy rules for objecting to discharge jurisdictional?", "question_category": "SCALR", "source": "Lexis", "case_id": "scalr-15"}
{"question": "Bankruptcy Rules permit discharge of a student loan only through an adversary proceeding, commenced by filing a complaint and serving it and a summons on an appropriate agent of the creditor. Instead, debtor merely included a declaration of discharge in his Chapter 13 plan and mailed it to creditor's post office box. Does such procedure meet the rigorous demands of due process and entitle the resulting orders to respect under principles of res judicata?", "question_category": "SCALR", "source": "Lexis", "case_id": "scalr-16"}
{"question": "Must a district court admit \"me, too\" evidence -- i.e., testimony, by nonparties, alleging discrimination at the hands of persons who played no role in the adverse employment decision challenged by the plaintiff?", "question_category": "SCALR", "source": "Lexis", "case_id": "scalr-17"}
{"question": "In Phillips v. Washington Legal Found. , 524 U .S. 156 (1998), the Supreme Court held that the interest on clients' funds held in so-called IOLTA accounts (\"Interest on Lawyers' Trust Accounts\") was the property of the clients. Does a regulatory scheme for funding state legal services by systematically seizing this property violate the Takings Clause of the Fifth Amendment to the Constitution such that the property owners are entitled to relief?", "question_category": "SCALR", "source": "Lexis", "case_id": "scalr-18"}
{"question": "Do 28 U.S.C §§1346(b) and 2680(h) waive the sovereign immunity of the United States for the intentional torts of prison guards when they are acting within the scope of their employment but are not exercising their authority to execute searches, to seize evidence, or to make arrests for violations of federal law?", "question_category": "SCALR", "source": "Lexis", "case_id": "scalr-20"}
{"question": "A department of corrections revised its prison visitation policy to: (1) prohibit visits by a minor child, unless the minor is the child, stepchild or grandchild of the prisoner; (2) prohibit visits by a prisoner's child when the prisoner's parental rights have been terminated; (3) require that all visiting minor children be accompanied by a parent or legal guardian; (4) prohibit visits by former inmates unless the former inmate is in the prisoner's immediate family; and (5) impose a ban on visitation for a minimum of two years for any inmate found guilty of two or more major misconducts for substance abuse. Do the policies violate the prisoners’ First and Fourteenth Amendment rights?", "question_category": "SCALR", "source": "Lexis", "case_id": "scalr-21"}
{"question": "Does a defendant-who has fraudulently obtained a loan and thus owes restitution for the loan under 18 U.S.C. § 3663A(b)(1)(B)-return \"any part\" of the loan money by giving the lenders the collateral that secures the money?", "question_category": "SCALR", "source": "Lexis", "case_id": "scalr-27"}
{"question": "Does a case become moot, and thus beyond the judicial power of Article III, when the lone plaintiff receives an offer from the defendants to satisfy all of the plaintiff's claims?", "question_category": "SCALR", "source": "Lexis", "case_id": "scalr-30"}
{"question": "What are the four fair use factors?", "question_category": "Rule QA", "source": "Lexis", "case_id": "rule-qa-32"}
{"question": "Per the Hertz \"nerve center\" test, where is a corporation's principal place of business?", "question_category": "Rule QA", "source": "Lexis", "case_id": "rule-qa-33"}
{"question": "What are the 5 categories for distinctiveness under the Abercrombie spectrum for trademarks?", "question_category": "Rule QA", "source": "Lexis", "case_id": "rule-qa-34"}
{"question": "Under the Abercrombie distinctiveness spectrum, what are suggestive terms?", "question_category": "Rule QA", "source": "Lexis", "case_id": "rule-qa-35"}
{"question": "Under the Abercrombie distinctiveness spectrum, what are fanciful terms?", "question_category": "Rule QA", "source": "Lexis", "case_id": "rule-qa-39"}
{"question": "What are the two types of fair use defenses for trademarks?", "question_category": "Rule QA", "source": "Lexis", "case_id": "rule-qa-41"}
{"question": "What are the 6 enumerated factors for a trademark blurring claim?", "question_category": "Rule QA", "source": "Lexis", "case_id": "rule-qa-44"}
{"question": "What are the requirements for a dying declaration?", "question_category": "Rule QA", "source": "Lexis", "case_id": "rule-qa-48"}
{"question": "What is a co-conspirator admission under the Federal Rules of Evidence?", "question_category": "Rule QA", "source": "Lexis", "case_id": "rule-qa-49"}
{"question": "For which types of cases is a dying declaration admissible in federal court?", "question_category": "Rule QA", "source": "Lexis", "case_id": "rule-qa-50"}
{"question": "In the Fifth Circuit, can a person subject to domestic-violence-related restraining orders be prohibited from purchasing a firearm?", "question_category": "Changes in Law", "source": "Lexis", "case_id": "changes-in-law-71"}
{"question": "When does the undue burden standard apply in abortion cases?", "question_category": "Changes in Law", "source": "Lexis", "case_id": "changes-in-law-73"}
{"question": "In California, can a nurse practitioner ever perform an abortion without a physician present?", "question_category": "Changes in Law", "source": "Lexis", "case_id": "changes-in-law-74"}
{"question": "Is it a crime to camp on state-owned lands in Missouri without authorization?", "question_category": "Changes in Law", "source": "Lexis", "case_id": "changes-in-law-75"}
{"question": "Do law enforcement officers in California have to inform drivers why they are being pulled over?", "question_category": "Changes in Law", "source": "Lexis", "case_id": "changes-in-law-77"}
{"question": "A city passed an ordinance prohibiting doorto-door solicitation of contributions by charitable organizations that did not use at least 75% of their receipts for \"charitable purposes.\" The ordinance further provided that anyone wishing to solicit for purposes of charity must obtain a permit and present satisfactory proof that at least 75% of the proceeds of such solicitation will be used directly for the charitable purposes of the organization. An organization seeking to solicit support within the city applied for and was denied a permit because it did not meet the 75% requirement. As applied to the organization, is the ordinance constitutional?", "question_category": "Bar Exam", "source": "Lexis", "case_id": "bar-exam-82"}
{"question": "A mechanic was tried for the aggravated assault of a nurse. The mechanic called a witness to the witness stand. The witness was to testify that the night before the alleged crime, the mechanic stated to the witness that he was going to visit his mother in a distant city some 1,000 miles away. Is the testimony admissible?", "question_category": "Bar Exam", "source": "Lexis", "case_id": "bar-exam-83"}
{"question": "A patient troubled by an irritating skin rash consulted a dermatologist for treatment. The dermatologist diagnosed the rash as a genetic condition that had no cure and would ultimately spread and lead to disfigurement. The patient was shocked and upset by the diagnosis. On the advice of her family, a week later the patient consulted another doctor. That doctor immediately diagnosed the skin rash as a common bacterial infection and prescribed an ointment that cleared up the condition in a few days. Because the doctor was a friend of the family, the patient was not charged for that visit. Can the patient recover from the dermatologist for the emotional distress caused by his erroneous diagnosis?", "question_category": "Bar Exam", "source": "Lexis", "case_id": "bar-exam-86"}
{"question": "A patient went to a highly reputable dentist, who honestly told her that she needed a lot of dental work, some of it involving complex procedures. When she asked the dentist what the cost would be, he told her \"about $3,500.\" The patient agreed to use him as her dentist and he began her treatment. When the patient's treatment was finished, the dentist sent her a bill for $4,100, explaining that the higher bill was because more expensive inlays were used, and that he carefully documented the cost of his materials and had sound medical reasons for his decision. The patient honestly believed that it was unfair for the dentist to charge her $4,100. Therefore, she sent the dentist's invoice back to him, along with a check for $3,500. On the check the patient had clearly written \"Payment In Full.\" The dentist read the notation on the check and deposited it at his bank. The dentist made no notation of his own on the check other than his signature on the back as an indorsement. Two weeks later the dentist called his bank to make sure that the patient's check had cleared. He then immediately filed suit against the patient for $600. Will the court award the dentist $600?", "question_category": "Bar Exam", "source": "Lexis", "case_id": "bar-exam-88"}
{"question": "A young man proposed to his girlfriend, but she was reluctant because of his meager income and lack of job potential. The young man told his father about her reluctance. The father told the girlfriend that if she married his son, he would support them for six months and send his son to a six-month computer technology training school. This was sufficient to dispel her reservations and the two were married very soon after. When they returned from their honeymoon, the father refused to go through with his offer. Although the girlfriend is happy in her marriage, she sued the father for damages. If the father prevails, it will be because:", "question_category": "Bar Exam", "source": "Lexis", "case_id": "bar-exam-89"}
{"question": "A plaintiff applied for a life insurance policy and was required to submit to a physical examination to qualify for the policy. During the course of the examination, the plaintiff told the physician, who was approved by the life insurance company and had never seen the plaintiff before, \"I used to have some back trouble, but that's all cleared up now.\" A few weeks after the examination, the defendant's automobile struck the rear end of a car in which the plaintiff was riding as a passenger. The plaintiff now claims that he suffers persistent lower back pain and sues the defendant for damages. After laying a proper foundation that the plaintiff is attempting to perpetrate a fraud, the defendant calls the physician as a witness and seeks to have her testify as to the plaintiff's statement to her. The plaintiff's attorney objects on the ground of the jurisdiction's physician-patient privilege. Is the testimony as to the plaintiff's statement admissible?", "question_category": "Bar Exam", "source": "Lexis", "case_id": "bar-exam-90"}
{"question": "The owner of a large parcel of land subdivided it into 20 separate lots. He sold lots 1-19, retaining lot 20 for himself to live on. The deeds for each of the 19 lots sold by the owner contained the following restriction: \"All lots within the subdivision shall be used for residential purposes only.\" The purchasers of lots 1-19 each built residences on their property. The owner lived on lot 20 until his death, when it was sold without any restrictions to a buyer. Subsequently, the buyer sold lot 20 to a grocer, furnishing him with an abstract of title and assuring him that the land was unrestricted. The abstract of title showed that lot 20 was not restricted. The following year, the grocer decided to build a grocery store on lot 20. A homeowner who owned adjoining property in the subdivision informed the grocer of the restriction and told him that he would be unable to build the grocery store. If the homeowner brings suit seeking an injunction against the grocer's building of the grocery store, will she prevail?", "question_category": "Bar Exam", "source": "Lexis", "case_id": "bar-exam-93"}
{"question": "A friend knew that a man and a woman cared deeply for each other and encouraged the man to ask the woman to marry. Unbeknownst to the friend, the man was already married. Finally, after continued encouragement by the friend, the man went through a marriage ceremony with the woman, and the friend was the man's best man at the ceremony. If the friend is charged with being an accessory to bigamy, should he be found guilty or not guilty?", "question_category": "Bar Exam", "source": "Lexis", "case_id": "bar-exam-95"}
{"question": "Traveler was a passenger on a commercial aircraft owned and operated by Airline. The aircraft crashed into a mountain, killing everyone on board. The flying weather was good. Traveler's legal representative brought a wrongful death action against Airline. At trial, the legal representative offered no expert or other testimony as to the cause of the crash. On Airline's motion to dismiss at the conclusion of the legal representative's case, should the court grant or deny the motion?", "question_category": "Bar Exam", "source": "Lexis", "case_id": "bar-exam-96"}
{"question": "In a criminal trial, the prosecutor called a witness to the stand to authenticate the voice in a tape recording as the defendant's. The only other time the witness had heard the defendant's voice was after his arrest. Assuming a proper foundation has been laid, may the witness properly authenticate the defendant's voice?", "question_category": "Bar Exam", "source": "Lexis", "case_id": "bar-exam-98"}
{"question": "Does the inevitable discovery doctrine create a per se exception to the exclusionary rule for evidence seized after a Fourth Amendment \"knock and announce\" violation or is evidence subject to suppression after such violations?", "question_category": "SCALR", "source": "GPT-4", "case_id": "scalr-1"}
{"question": "Is it the case that a claimed invention cannot be held \"obvious\", and thus unpatentable under 35 U.S.C. § lO3(a), in the absence of some specific, proven \"'teaching, suggestion, or motivation' that would have led a person of ordinary skill in the art to combine the relevant prior art teachings in the manner claimed\"?", "question_category": "SCALR", "source": "GPT-4", "case_id": "scalr-2"}
{"question": "Did Congress divest the federal district courts of their federal-question jurisdiction under 28 U.S.C. § 1331 over private actions brought under the Telephone Consumer Protection Act?", "question_category": "SCALR", "source": "GPT-4", "case_id": "scalr-5"}
{"question": "Prosecutors in the Orleans Parish District Attorney's Office hid exculpatory evidence, violating John Thompson's rights under Brady v. Maryland, 373 U.S. 83 (1963). Despite no history of similar violations, the office was found liable under § 1983 for failing to train prosecutors. Inadequate training may give rise to municipal liability if it shows \"deliberate indifference\" and actually causes a violation. See City of Canton v. Harris, 489 U.S. 658, 389-91 (1978); Bd. of County Comm'rs of Bryan County v. Brown, 520 U.S. 397, 403-07 (1997). A pattern of violations is usually necessary to show culpability and causation, but in rare cases one violation may suffice. Bryan County, 520 U.S., at 409. The Court has hypothesized only one example justifying single-incident liability: a failure to train police officers on using deadly force. See Canton, 489 U.S., at 390 n.10. Does imposing failure-to-train liability on a district attorney's office for a single Brady violation contravene the rigorous culpability and causation standards of Canton and Bryan County?", "question_category": "SCALR", "source": "GPT-4", "case_id": "scalr-7"}
{"question": "Should the Federal Communications Commission’s determination that the broadcast of vulgar expletives may violate federal restrictions on the broadcast of “any obscene, indecent, or profane language,” 18 U.S.C. 1464; see 47 C.F.R. 73.3999, when the expletives are not repeated, be stricken down?", "question_category": "SCALR", "source": "GPT-4", "case_id": "scalr-11"}
{"question": "Does the Equal Protection Clause precludee a local taxing authority from refusing to refund payments made by those who have paid their assessments in full, even though they forgave the obligations of identically situated taxpayers who chose to pay over a multi-year installment plan?", "question_category": "SCALR", "source": "GPT-4", "case_id": "scalr-13"}
{"question": "Is a habeas petitioner's claim considered \"adjudicated on the merits\" for purposes of 28 U.S.C. § 2254(d) where the state court denied relief in an explained decision but did not expressly acknowledge a federal-law basis for the claim?", "question_category": "SCALR", "source": "GPT-4", "case_id": "scalr-14"}
{"question": "The deadlines for objecting to a debtor's discharge in bankruptcy are set by Bankruptcy Rule 4004. Are the deadlines established by the bankruptcy rules for objecting to discharge jurisdictional?", "question_category": "SCALR", "source": "GPT-4", "case_id": "scalr-15"}
{"question": "Bankruptcy Rules permit discharge of a student loan only through an adversary proceeding, commenced by filing a complaint and serving it and a summons on an appropriate agent of the creditor. Instead, debtor merely included a declaration of discharge in his Chapter 13 plan and mailed it to creditor's post office box. Does such procedure meet the rigorous demands of due process and entitle the resulting orders to respect under principles of res judicata?", "question_category": "SCALR", "source": "GPT-4", "case_id": "scalr-16"}
{"question": "Must a district court admit \"me, too\" evidence -- i.e., testimony, by nonparties, alleging discrimination at the hands of persons who played no role in the adverse employment decision challenged by the plaintiff?", "question_category": "SCALR", "source": "GPT-4", "case_id": "scalr-17"}
{"question": "In Phillips v. Washington Legal Found. , 524 U .S. 156 (1998), the Supreme Court held that the interest on clients' funds held in so-called IOLTA accounts (\"Interest on Lawyers' Trust Accounts\") was the property of the clients. Does a regulatory scheme for funding state legal services by systematically seizing this property violate the Takings Clause of the Fifth Amendment to the Constitution such that the property owners are entitled to relief?", "question_category": "SCALR", "source": "GPT-4", "case_id": "scalr-18"}
{"question": "Do 28 U.S.C §§1346(b) and 2680(h) waive the sovereign immunity of the United States for the intentional torts of prison guards when they are acting within the scope of their employment but are not exercising their authority to execute searches, to seize evidence, or to make arrests for violations of federal law?", "question_category": "SCALR", "source": "GPT-4", "case_id": "scalr-20"}
{"question": "A department of corrections revised its prison visitation policy to: (1) prohibit visits by a minor child, unless the minor is the child, stepchild or grandchild of the prisoner; (2) prohibit visits by a prisoner's child when the prisoner's parental rights have been terminated; (3) require that all visiting minor children be accompanied by a parent or legal guardian; (4) prohibit visits by former inmates unless the former inmate is in the prisoner's immediate family; and (5) impose a ban on visitation for a minimum of two years for any inmate found guilty of two or more major misconducts for substance abuse. Do the policies violate the prisoners’ First and Fourteenth Amendment rights?", "question_category": "SCALR", "source": "GPT-4", "case_id": "scalr-21"}
{"question": "Does a defendant-who has fraudulently obtained a loan and thus owes restitution for the loan under 18 U.S.C. § 3663A(b)(1)(B)-return \"any part\" of the loan money by giving the lenders the collateral that secures the money?", "question_category": "SCALR", "source": "GPT-4", "case_id": "scalr-27"}
{"question": "Does a case become moot, and thus beyond the judicial power of Article III, when the lone plaintiff receives an offer from the defendants to satisfy all of the plaintiff's claims?", "question_category": "SCALR", "source": "GPT-4", "case_id": "scalr-30"}
{"question": "What are the four fair use factors?", "question_category": "Rule QA", "source": "GPT-4", "case_id": "rule-qa-32"}
{"question": "Per the Hertz \"nerve center\" test, where is a corporation's principal place of business?", "question_category": "Rule QA", "source": "GPT-4", "case_id": "rule-qa-33"}
{"question": "What are the 5 categories for distinctiveness under the Abercrombie spectrum for trademarks?", "question_category": "Rule QA", "source": "GPT-4", "case_id": "rule-qa-34"}
{"question": "Under the Abercrombie distinctiveness spectrum, what are suggestive terms?", "question_category": "Rule QA", "source": "GPT-4", "case_id": "rule-qa-35"}
{"question": "Under the Abercrombie distinctiveness spectrum, what are fanciful terms?", "question_category": "Rule QA", "source": "GPT-4", "case_id": "rule-qa-39"}
{"question": "What are the two types of fair use defenses for trademarks?", "question_category": "Rule QA", "source": "GPT-4", "case_id": "rule-qa-41"}
{"question": "What are the 6 enumerated factors for a trademark blurring claim?", "question_category": "Rule QA", "source": "GPT-4", "case_id": "rule-qa-44"}
{"question": "What are the requirements for a dying declaration?", "question_category": "Rule QA", "source": "GPT-4", "case_id": "rule-qa-48"}
{"question": "What is a co-conspirator admission under the Federal Rules of Evidence?", "question_category": "Rule QA", "source": "GPT-4", "case_id": "rule-qa-49"}
{"question": "For which types of cases is a dying declaration admissible in federal court?", "question_category": "Rule QA", "source": "GPT-4", "case_id": "rule-qa-50"}
{"question": "In the Fifth Circuit, can a person subject to domestic-violence-related restraining orders be prohibited from purchasing a firearm?", "question_category": "Changes in Law", "source": "GPT-4", "case_id": "changes-in-law-71"}
{"question": "When does the undue burden standard apply in abortion cases?", "question_category": "Changes in Law", "source": "GPT-4", "case_id": "changes-in-law-73"}
{"question": "In California, can a nurse practitioner ever perform an abortion without a physician present?", "question_category": "Changes in Law", "source": "GPT-4", "case_id": "changes-in-law-74"}
{"question": "Is it a crime to camp on state-owned lands in Missouri without authorization?", "question_category": "Changes in Law", "source": "GPT-4", "case_id": "changes-in-law-75"}
{"question": "Do law enforcement officers in California have to inform drivers why they are being pulled over?", "question_category": "Changes in Law", "source": "GPT-4", "case_id": "changes-in-law-77"}
{"question": "A city passed an ordinance prohibiting doorto-door solicitation of contributions by charitable organizations that did not use at least 75% of their receipts for \"charitable purposes.\" The ordinance further provided that anyone wishing to solicit for purposes of charity must obtain a permit and present satisfactory proof that at least 75% of the proceeds of such solicitation will be used directly for the charitable purposes of the organization. An organization seeking to solicit support within the city applied for and was denied a permit because it did not meet the 75% requirement. As applied to the organization, is the ordinance constitutional?", "question_category": "Bar Exam", "source": "GPT-4", "case_id": "bar-exam-82"}
{"question": "A mechanic was tried for the aggravated assault of a nurse. The mechanic called a witness to the witness stand. The witness was to testify that the night before the alleged crime, the mechanic stated to the witness that he was going to visit his mother in a distant city some 1,000 miles away. Is the testimony admissible?", "question_category": "Bar Exam", "source": "GPT-4", "case_id": "bar-exam-83"}
{"question": "A patient troubled by an irritating skin rash consulted a dermatologist for treatment. The dermatologist diagnosed the rash as a genetic condition that had no cure and would ultimately spread and lead to disfigurement. The patient was shocked and upset by the diagnosis. On the advice of her family, a week later the patient consulted another doctor. That doctor immediately diagnosed the skin rash as a common bacterial infection and prescribed an ointment that cleared up the condition in a few days. Because the doctor was a friend of the family, the patient was not charged for that visit. Can the patient recover from the dermatologist for the emotional distress caused by his erroneous diagnosis?", "question_category": "Bar Exam", "source": "GPT-4", "case_id": "bar-exam-86"}
{"question": "A patient went to a highly reputable dentist, who honestly told her that she needed a lot of dental work, some of it involving complex procedures. When she asked the dentist what the cost would be, he told her \"about $3,500.\" The patient agreed to use him as her dentist and he began her treatment. When the patient's treatment was finished, the dentist sent her a bill for $4,100, explaining that the higher bill was because more expensive inlays were used, and that he carefully documented the cost of his materials and had sound medical reasons for his decision. The patient honestly believed that it was unfair for the dentist to charge her $4,100. Therefore, she sent the dentist's invoice back to him, along with a check for $3,500. On the check the patient had clearly written \"Payment In Full.\" The dentist read the notation on the check and deposited it at his bank. The dentist made no notation of his own on the check other than his signature on the back as an indorsement. Two weeks later the dentist called his bank to make sure that the patient's check had cleared. He then immediately filed suit against the patient for $600. Will the court award the dentist $600?", "question_category": "Bar Exam", "source": "GPT-4", "case_id": "bar-exam-88"}
{"question": "A young man proposed to his girlfriend, but she was reluctant because of his meager income and lack of job potential. The young man told his father about her reluctance. The father told the girlfriend that if she married his son, he would support them for six months and send his son to a six-month computer technology training school. This was sufficient to dispel her reservations and the two were married very soon after. When they returned from their honeymoon, the father refused to go through with his offer. Although the girlfriend is happy in her marriage, she sued the father for damages. If the father prevails, it will be because:", "question_category": "Bar Exam", "source": "GPT-4", "case_id": "bar-exam-89"}
{"question": "A plaintiff applied for a life insurance policy and was required to submit to a physical examination to qualify for the policy. During the course of the examination, the plaintiff told the physician, who was approved by the life insurance company and had never seen the plaintiff before, \"I used to have some back trouble, but that's all cleared up now.\" A few weeks after the examination, the defendant's automobile struck the rear end of a car in which the plaintiff was riding as a passenger. The plaintiff now claims that he suffers persistent lower back pain and sues the defendant for damages. After laying a proper foundation that the plaintiff is attempting to perpetrate a fraud, the defendant calls the physician as a witness and seeks to have her testify as to the plaintiff's statement to her. The plaintiff's attorney objects on the ground of the jurisdiction's physician-patient privilege. Is the testimony as to the plaintiff's statement admissible?", "question_category": "Bar Exam", "source": "GPT-4", "case_id": "bar-exam-90"}
{"question": "The owner of a large parcel of land subdivided it into 20 separate lots. He sold lots 1-19, retaining lot 20 for himself to live on. The deeds for each of the 19 lots sold by the owner contained the following restriction: \"All lots within the subdivision shall be used for residential purposes only.\" The purchasers of lots 1-19 each built residences on their property. The owner lived on lot 20 until his death, when it was sold without any restrictions to a buyer. Subsequently, the buyer sold lot 20 to a grocer, furnishing him with an abstract of title and assuring him that the land was unrestricted. The abstract of title showed that lot 20 was not restricted. The following year, the grocer decided to build a grocery store on lot 20. A homeowner who owned adjoining property in the subdivision informed the grocer of the restriction and told him that he would be unable to build the grocery store. If the homeowner brings suit seeking an injunction against the grocer's building of the grocery store, will she prevail?", "question_category": "Bar Exam", "source": "GPT-4", "case_id": "bar-exam-93"}
{"question": "A friend knew that a man and a woman cared deeply for each other and encouraged the man to ask the woman to marry. Unbeknownst to the friend, the man was already married. Finally, after continued encouragement by the friend, the man went through a marriage ceremony with the woman, and the friend was the man's best man at the ceremony. If the friend is charged with being an accessory to bigamy, should he be found guilty or not guilty?", "question_category": "Bar Exam", "source": "GPT-4", "case_id": "bar-exam-95"}
{"question": "Traveler was a passenger on a commercial aircraft owned and operated by Airline. The aircraft crashed into a mountain, killing everyone on board. The flying weather was good. Traveler's legal representative brought a wrongful death action against Airline. At trial, the legal representative offered no expert or other testimony as to the cause of the crash. On Airline's motion to dismiss at the conclusion of the legal representative's case, should the court grant or deny the motion?", "question_category": "Bar Exam", "source": "GPT-4", "case_id": "bar-exam-96"}
{"question": "In a criminal trial, the prosecutor called a witness to the stand to authenticate the voice in a tape recording as the defendant's. The only other time the witness had heard the defendant's voice was after his arrest. Assuming a proper foundation has been laid, may the witness properly authenticate the defendant's voice?", "question_category": "Bar Exam", "source": "GPT-4", "case_id": "bar-exam-98"}
{"question": "Does the inevitable discovery doctrine create a per se exception to the exclusionary rule for evidence seized after a Fourth Amendment \"knock and announce\" violation or is evidence subject to suppression after such violations?", "question_category": "SCALR", "source": null, "case_id": "scalr-1"}
{"question": "Is it the case that a claimed invention cannot be held \"obvious\", and thus unpatentable under 35 U.S.C. § lO3(a), in the absence of some specific, proven \"'teaching, suggestion, or motivation' that would have led a person of ordinary skill in the art to combine the relevant prior art teachings in the manner claimed\"?", "question_category": "SCALR", "source": null, "case_id": "scalr-2"}
{"question": "Did Congress divest the federal district courts of their federal-question jurisdiction under 28 U.S.C. § 1331 over private actions brought under the Telephone Consumer Protection Act?", "question_category": "SCALR", "source": null, "case_id": "scalr-5"}
{"question": "Prosecutors in the Orleans Parish District Attorney's Office hid exculpatory evidence, violating John Thompson's rights under Brady v. Maryland, 373 U.S. 83 (1963). Despite no history of similar violations, the office was found liable under § 1983 for failing to train prosecutors. Inadequate training may give rise to municipal liability if it shows \"deliberate indifference\" and actually causes a violation. See City of Canton v. Harris, 489 U.S. 658, 389-91 (1978); Bd. of County Comm'rs of Bryan County v. Brown, 520 U.S. 397, 403-07 (1997). A pattern of violations is usually necessary to show culpability and causation, but in rare cases one violation may suffice. Bryan County, 520 U.S., at 409. The Court has hypothesized only one example justifying single-incident liability: a failure to train police officers on using deadly force. See Canton, 489 U.S., at 390 n.10. Does imposing failure-to-train liability on a district attorney's office for a single Brady violation contravene the rigorous culpability and causation standards of Canton and Bryan County?", "question_category": "SCALR", "source": null, "case_id": "scalr-7"}
{"question": "Should the Federal Communications Commission’s determination that the broadcast of vulgar expletives may violate federal restrictions on the broadcast of “any obscene, indecent, or profane language,” 18 U.S.C. 1464; see 47 C.F.R. 73.3999, when the expletives are not repeated, be stricken down?", "question_category": "SCALR", "source": null, "case_id": "scalr-11"}
{"question": "Does the Equal Protection Clause precludee a local taxing authority from refusing to refund payments made by those who have paid their assessments in full, even though they forgave the obligations of identically situated taxpayers who chose to pay over a multi-year installment plan?", "question_category": "SCALR", "source": null, "case_id": "scalr-13"}
{"question": "Is a habeas petitioner's claim considered \"adjudicated on the merits\" for purposes of 28 U.S.C. § 2254(d) where the state court denied relief in an explained decision but did not expressly acknowledge a federal-law basis for the claim?", "question_category": "SCALR", "source": null, "case_id": "scalr-14"}
{"question": "The deadlines for objecting to a debtor's discharge in bankruptcy are set by Bankruptcy Rule 4004. Are the deadlines established by the bankruptcy rules for objecting to discharge jurisdictional?", "question_category": "SCALR", "source": null, "case_id": "scalr-15"}
{"question": "Bankruptcy Rules permit discharge of a student loan only through an adversary proceeding, commenced by filing a complaint and serving it and a summons on an appropriate agent of the creditor. Instead, debtor merely included a declaration of discharge in his Chapter 13 plan and mailed it to creditor's post office box. Does such procedure meet the rigorous demands of due process and entitle the resulting orders to respect under principles of res judicata?", "question_category": "SCALR", "source": null, "case_id": "scalr-16"}
{"question": "Must a district court admit \"me, too\" evidence -- i.e., testimony, by nonparties, alleging discrimination at the hands of persons who played no role in the adverse employment decision challenged by the plaintiff?", "question_category": "SCALR", "source": null, "case_id": "scalr-17"}
{"question": "In Phillips v. Washington Legal Found. , 524 U .S. 156 (1998), the Supreme Court held that the interest on clients' funds held in so-called IOLTA accounts (\"Interest on Lawyers' Trust Accounts\") was the property of the clients. Does a regulatory scheme for funding state legal services by systematically seizing this property violate the Takings Clause of the Fifth Amendment to the Constitution such that the property owners are entitled to relief?", "question_category": "SCALR", "source": null, "case_id": "scalr-18"}
{"question": "Do 28 U.S.C §§1346(b) and 2680(h) waive the sovereign immunity of the United States for the intentional torts of prison guards when they are acting within the scope of their employment but are not exercising their authority to execute searches, to seize evidence, or to make arrests for violations of federal law?", "question_category": "SCALR", "source": null, "case_id": "scalr-20"}
{"question": "A department of corrections revised its prison visitation policy to: (1) prohibit visits by a minor child, unless the minor is the child, stepchild or grandchild of the prisoner; (2) prohibit visits by a prisoner's child when the prisoner's parental rights have been terminated; (3) require that all visiting minor children be accompanied by a parent or legal guardian; (4) prohibit visits by former inmates unless the former inmate is in the prisoner's immediate family; and (5) impose a ban on visitation for a minimum of two years for any inmate found guilty of two or more major misconducts for substance abuse. Do the policies violate the prisoners’ First and Fourteenth Amendment rights?", "question_category": "SCALR", "source": null, "case_id": "scalr-21"}
{"question": "Does a defendant-who has fraudulently obtained a loan and thus owes restitution for the loan under 18 U.S.C. § 3663A(b)(1)(B)-return \"any part\" of the loan money by giving the lenders the collateral that secures the money?", "question_category": "SCALR", "source": null, "case_id": "scalr-27"}
{"question": "Does a case become moot, and thus beyond the judicial power of Article III, when the lone plaintiff receives an offer from the defendants to satisfy all of the plaintiff's claims?", "question_category": "SCALR", "source": null, "case_id": "scalr-30"}
{"question": "What are the four fair use factors?", "question_category": "Rule QA", "source": null, "case_id": "rule-qa-32"}
{"question": "Per the Hertz \"nerve center\" test, where is a corporation's principal place of business?", "question_category": "Rule QA", "source": null, "case_id": "rule-qa-33"}
{"question": "What are the 5 categories for distinctiveness under the Abercrombie spectrum for trademarks?", "question_category": "Rule QA", "source": null, "case_id": "rule-qa-34"}
{"question": "Under the Abercrombie distinctiveness spectrum, what are suggestive terms?", "question_category": "Rule QA", "source": null, "case_id": "rule-qa-35"}
{"question": "Under the Abercrombie distinctiveness spectrum, what are fanciful terms?", "question_category": "Rule QA", "source": null, "case_id": "rule-qa-39"}
{"question": "What are the two types of fair use defenses for trademarks?", "question_category": "Rule QA", "source": null, "case_id": "rule-qa-41"}
{"question": "What are the 6 enumerated factors for a trademark blurring claim?", "question_category": "Rule QA", "source": null, "case_id": "rule-qa-44"}
{"question": "What are the requirements for a dying declaration?", "question_category": "Rule QA", "source": null, "case_id": "rule-qa-48"}
{"question": "What is a co-conspirator admission under the Federal Rules of Evidence?", "question_category": "Rule QA", "source": null, "case_id": "rule-qa-49"}
{"question": "For which types of cases is a dying declaration admissible in federal court?", "question_category": "Rule QA", "source": null, "case_id": "rule-qa-50"}
{"question": "In the Fifth Circuit, can a person subject to domestic-violence-related restraining orders be prohibited from purchasing a firearm?", "question_category": "Changes in Law", "source": null, "case_id": "changes-in-law-71"}
{"question": "When does the undue burden standard apply in abortion cases?", "question_category": "Changes in Law", "source": null, "case_id": "changes-in-law-73"}
{"question": "In California, can a nurse practitioner ever perform an abortion without a physician present?", "question_category": "Changes in Law", "source": null, "case_id": "changes-in-law-74"}
{"question": "Is it a crime to camp on state-owned lands in Missouri without authorization?", "question_category": "Changes in Law", "source": null, "case_id": "changes-in-law-75"}
{"question": "Do law enforcement officers in California have to inform drivers why they are being pulled over?", "question_category": "Changes in Law", "source": null, "case_id": "changes-in-law-77"}
{"question": "A city passed an ordinance prohibiting doorto-door solicitation of contributions by charitable organizations that did not use at least 75% of their receipts for \"charitable purposes.\" The ordinance further provided that anyone wishing to solicit for purposes of charity must obtain a permit and present satisfactory proof that at least 75% of the proceeds of such solicitation will be used directly for the charitable purposes of the organization. An organization seeking to solicit support within the city applied for and was denied a permit because it did not meet the 75% requirement. As applied to the organization, is the ordinance constitutional?", "question_category": "Bar Exam", "source": null, "case_id": "bar-exam-82"}
{"question": "A mechanic was tried for the aggravated assault of a nurse. The mechanic called a witness to the witness stand. The witness was to testify that the night before the alleged crime, the mechanic stated to the witness that he was going to visit his mother in a distant city some 1,000 miles away. Is the testimony admissible?", "question_category": "Bar Exam", "source": null, "case_id": "bar-exam-83"}
{"question": "A patient troubled by an irritating skin rash consulted a dermatologist for treatment. The dermatologist diagnosed the rash as a genetic condition that had no cure and would ultimately spread and lead to disfigurement. The patient was shocked and upset by the diagnosis. On the advice of her family, a week later the patient consulted another doctor. That doctor immediately diagnosed the skin rash as a common bacterial infection and prescribed an ointment that cleared up the condition in a few days. Because the doctor was a friend of the family, the patient was not charged for that visit. Can the patient recover from the dermatologist for the emotional distress caused by his erroneous diagnosis?", "question_category": "Bar Exam", "source": null, "case_id": "bar-exam-86"}
{"question": "A patient went to a highly reputable dentist, who honestly told her that she needed a lot of dental work, some of it involving complex procedures. When she asked the dentist what the cost would be, he told her \"about $3,500.\" The patient agreed to use him as her dentist and he began her treatment. When the patient's treatment was finished, the dentist sent her a bill for $4,100, explaining that the higher bill was because more expensive inlays were used, and that he carefully documented the cost of his materials and had sound medical reasons for his decision. The patient honestly believed that it was unfair for the dentist to charge her $4,100. Therefore, she sent the dentist's invoice back to him, along with a check for $3,500. On the check the patient had clearly written \"Payment In Full.\" The dentist read the notation on the check and deposited it at his bank. The dentist made no notation of his own on the check other than his signature on the back as an indorsement. Two weeks later the dentist called his bank to make sure that the patient's check had cleared. He then immediately filed suit against the patient for $600. Will the court award the dentist $600?", "question_category": "Bar Exam", "source": null, "case_id": "bar-exam-88"}
{"question": "A young man proposed to his girlfriend, but she was reluctant because of his meager income and lack of job potential. The young man told his father about her reluctance. The father told the girlfriend that if she married his son, he would support them for six months and send his son to a six-month computer technology training school. This was sufficient to dispel her reservations and the two were married very soon after. When they returned from their honeymoon, the father refused to go through with his offer. Although the girlfriend is happy in her marriage, she sued the father for damages. If the father prevails, it will be because:", "question_category": "Bar Exam", "source": null, "case_id": "bar-exam-89"}
{"question": "A plaintiff applied for a life insurance policy and was required to submit to a physical examination to qualify for the policy. During the course of the examination, the plaintiff told the physician, who was approved by the life insurance company and had never seen the plaintiff before, \"I used to have some back trouble, but that's all cleared up now.\" A few weeks after the examination, the defendant's automobile struck the rear end of a car in which the plaintiff was riding as a passenger. The plaintiff now claims that he suffers persistent lower back pain and sues the defendant for damages. After laying a proper foundation that the plaintiff is attempting to perpetrate a fraud, the defendant calls the physician as a witness and seeks to have her testify as to the plaintiff's statement to her. The plaintiff's attorney objects on the ground of the jurisdiction's physician-patient privilege. Is the testimony as to the plaintiff's statement admissible?", "question_category": "Bar Exam", "source": null, "case_id": "bar-exam-90"}
{"question": "The owner of a large parcel of land subdivided it into 20 separate lots. He sold lots 1-19, retaining lot 20 for himself to live on. The deeds for each of the 19 lots sold by the owner contained the following restriction: \"All lots within the subdivision shall be used for residential purposes only.\" The purchasers of lots 1-19 each built residences on their property. The owner lived on lot 20 until his death, when it was sold without any restrictions to a buyer. Subsequently, the buyer sold lot 20 to a grocer, furnishing him with an abstract of title and assuring him that the land was unrestricted. The abstract of title showed that lot 20 was not restricted. The following year, the grocer decided to build a grocery store on lot 20. A homeowner who owned adjoining property in the subdivision informed the grocer of the restriction and told him that he would be unable to build the grocery store. If the homeowner brings suit seeking an injunction against the grocer's building of the grocery store, will she prevail?", "question_category": "Bar Exam", "source": null, "case_id": "bar-exam-93"}
{"question": "A friend knew that a man and a woman cared deeply for each other and encouraged the man to ask the woman to marry. Unbeknownst to the friend, the man was already married. Finally, after continued encouragement by the friend, the man went through a marriage ceremony with the woman, and the friend was the man's best man at the ceremony. If the friend is charged with being an accessory to bigamy, should he be found guilty or not guilty?", "question_category": "Bar Exam", "source": null, "case_id": "bar-exam-95"}
{"question": "Traveler was a passenger on a commercial aircraft owned and operated by Airline. The aircraft crashed into a mountain, killing everyone on board. The flying weather was good. Traveler's legal representative brought a wrongful death action against Airline. At trial, the legal representative offered no expert or other testimony as to the cause of the crash. On Airline's motion to dismiss at the conclusion of the legal representative's case, should the court grant or deny the motion?", "question_category": "Bar Exam", "source": null, "case_id": "bar-exam-96"}
{"question": "In a criminal trial, the prosecutor called a witness to the stand to authenticate the voice in a tape recording as the defendant's. The only other time the witness had heard the defendant's voice was after his arrest. Assuming a proper foundation has been laid, may the witness properly authenticate the defendant's voice?", "question_category": "Bar Exam", "source": null, "case_id": "bar-exam-98"}
{"question": "A city enacts a law restricting campaign posters on public utility poles. A political group challenges it as violating free speech rights. Is the restriction constitutional?", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_001"}
{"question": "A homeowner discovers toxic chemicals leaking from a neighbor’s property onto his land. Discuss potential tort and nuisance claims.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_002"}
{"question": "A contract for the sale of goods is signed via email. The buyer later disputes its enforceability. Analyze under the UCC.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_003"}
{"question": "A tenant installs a costly fixture and later removes it before lease termination. The landlord sues. Who owns the fixture?", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_004"}
{"question": "Police search a locked glove compartment after an arrest for speeding. Is the search lawful under the Fourth Amendment?", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_005"}
{"question": "An attorney advertises 'Guaranteed Results!' online. The state bar investigates. Discuss ethical violations.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_006"}
{"question": "A defendant confesses after 12 hours of interrogation without counsel. Evaluate admissibility of the confession.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_007"}
{"question": "A law limits medical marijuana dispensaries to one per city. Analyze under equal protection and due process.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_008"}
{"question": "A seller fails to deliver goods because of a factory fire. The buyer sues for breach. Discuss doctrines of impossibility and frustration.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_009"}
{"question": "A corporation donates to a political campaign exceeding statutory limits. Discuss corporate and constitutional implications.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_010"}
{"question": "A child trespasses on construction property and is injured. Assess premises liability of the owner.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_011"}
{"question": "A man records a phone conversation without consent. Discuss admissibility and privacy implications under California law.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_012"}
{"question": "A will leaves property to 'my closest friends.' Discuss issues of testamentary intent and ambiguity.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_013"}
{"question": "A driver crashes after a car repair shop’s negligent brake installation. Analyze liability and defenses.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_014"}
{"question": "A business refuses service to a customer wearing religious clothing. Discuss relevant civil rights issues.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_015"}
{"question": "A teacher posts student grades online without consent. Discuss privacy violations and liability.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_016"}
{"question": "A partnership dissolves after one partner’s misconduct. Discuss distribution of assets and liabilities.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_017"}
{"question": "Police use a thermal scanner to detect indoor marijuana growth. Analyze under the Fourth Amendment.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_018"}
{"question": "A newspaper publishes confidential government data. The government seeks injunction. Discuss prior restraint.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_019"}
{"question": "A doctor discloses patient information to a friend. Discuss confidentiality and tort implications.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_020"}
{"question": "A company requires employees to waive jury trials in contracts. Analyze enforceability under California law.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_021"}
{"question": "An offer is revoked by mail but the offeree accepts by email before receiving revocation. Discuss contract formation.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_022"}
{"question": "A witness testifies to what another person told her about a crime. Discuss hearsay issues.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_023"}
{"question": "An attorney represents co-defendants with potential conflicts. Discuss ethical duties.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_024"}
{"question": "A statute prohibits minors from buying violent video games. Analyze constitutionality.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_025"}
{"question": "A tenant claims constructive eviction due to noise and mold. Discuss remedies.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_026"}
{"question": "A pedestrian is hit by a city bus. Discuss governmental immunity and negligence liability.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_027"}
{"question": "An employer fires a worker for jury duty absence. Analyze wrongful termination claims.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_028"}
{"question": "Police stop a vehicle because the driver 'looks suspicious.' Discuss Fourth Amendment implications.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_029"}
{"question": "A company’s non-compete clause restricts employment statewide. Evaluate enforceability under California law.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_030"}
{"question": "A borrower claims a lender’s 40% interest rate is unconscionable. Discuss remedies.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_031"}
{"question": "A celebrity’s image is used in advertising without consent. Discuss right of publicity and defenses.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_032"}
{"question": "A defendant claims entrapment after an undercover operation. Analyze legal standards.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_033"}
{"question": "A business refuses to hire based on criminal record. Discuss discrimination laws.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_034"}
{"question": "A city charges a fee for street performances. Analyze First Amendment implications.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_035"}
{"question": "A contract clause limits liability for gross negligence. Discuss enforceability.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_036"}
{"question": "A neighbor builds a fence encroaching on adjoining land. Discuss remedies.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_037"}
{"question": "A parent sues a school for negligent supervision after a playground injury. Evaluate liability.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_038"}
{"question": "A police officer’s off-duty conduct is disciplined by the department. Analyze due process claims.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_039"}
{"question": "A lawyer accidentally reveals privileged emails. Discuss ethical obligations.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_040"}
{"question": "A company’s algorithm discriminates in hiring. Discuss liability under anti-discrimination law.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_041"}
{"question": "A trust provision disinherits heirs who contest the will. Analyze enforceability.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_042"}
{"question": "A landlord withholds a security deposit for 'cleaning fees' not specified in the lease. Discuss tenant remedies.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_043"}
{"question": "A spouse secretly records a conversation during marriage dissolution proceedings. Discuss admissibility.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_044"}
{"question": "A protest group blocks freeway traffic. Discuss potential criminal and First Amendment issues.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_045"}
{"question": "A judge posts case commentary online while trial is pending. Discuss ethical implications.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_046"}
{"question": "A company delays product delivery due to supplier bankruptcy. Discuss UCC remedies.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_047"}
{"question": "A witness refuses to testify citing Fifth Amendment rights. Discuss scope and limits.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_048"}
{"question": "A minor enters a car purchase contract then seeks rescission. Discuss enforceability.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_049"}
{"question": "A law bans public employees from wearing political buttons. Analyze constitutionality.", "question_category": "Bar Exam", "source": "https://www.calbar.ca.gov/Admissions/Examinations/California-Bar-Examination/Past-Exams", "case_id": "CA_BAR_050"}
